Revit 2026 API

# FillGridSetSegments Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSegments(
	IList<double> segArr
)
```
```vb
Public Sub SetSegments (
	segArr As IList(Of Double)
)
```
```cpp
public:
void SetSegments(
	IList<double>^ segArr
)
```
```fsharp
member SetSegments :
        segArr : IList<float> -> unit
```

#### Parameters

segArr IListDouble

#### Reference

FillGrid Class

Autodesk.Revit.DB Namespace